Revit 2027 API
Grid.Create(Document, Line) Method
 Creates a new grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Grid Create(
	Document document,
	Line line
)
Public Shared Function Create (
	document As Document,
	line As Line
) As Grid
public:
static Grid^ Create(
	Document^ document,
	Line^ line
)
static member Create :
        document : Document *
        line : Line -> Grid
Parameters
document Document
 The document in which the new instance is created.
line Line
 A line which represents the location of the grid line.
Return Value
Grid
 The newly created grid.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The input line is not on a horizontal plane.
ArgumentNullException |  A non-optional argument was null
Remarks
 The line should be on a horizontal plane.
Example
// Create the geometry line which the grid locates
 XYZ start = new XYZ(0, 0, 0);
 XYZ end = new XYZ(30, 30, 0);
 Line geomLine = Line.CreateBound(start, end);
 // Create a grid using the geometry line
 Grid lineGrid = Grid.Create(document, geomLine);
 if (null == lineGrid)
 {
     throw new Exception("Create a new straight grid failed.");
 }
 // Modify the name of the created grid
 lineGrid.Name = "New Name1";
See Also
Reference
Grid Class
Create Overload
Autodesk.Revit.DB Namespace